app/Controllers/Home.php

    public function index()
    {
        $categorias = new Categoria();
        $produtos = new Produto();
        $clientes = new Cliente();
        $vendas   = new Venda();

        $dashboard = [
            'categoria' => $categorias->countAllResults(),
            'produto'   => $produtos->countAllResults(),
            'cliente'   => $clientes->countAllResults(),
            'venda'     => $vendas->countAllResults(),
            'grafico'   => $this->vendasPorDia(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `categoria`
WHERE `categoria`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `produto`
WHERE `produto`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `venda`
WHERE `venda`.`deleted_at` IS NULL

    private function vendasPorDia()
    {
        $vendas = new Venda();
        $dados = $vendas->select('datacompra,qtde')->groupBy('datacompra')->selectCount('id')->orderBy('datacompra', 'asc')->findAll();

        $dados1 = $vendas->select('(date_format(datacompra,"%d/%m/%Y")) as data, id')->selectSum('qtde', 'total')->groupBy('datacompra')->orderBy('datacompra', 'asc')->findAll();
---
SELECT `datacompra`, `qtde`, COUNT(`id`) AS `id`
FROM `venda`
WHERE `venda`.`deleted_at` IS NULL
GROUP BY `datacompra`
ORDER BY `datacompra` ASC
SELECT (date_format(datacompra, "%d/%m/%Y")) as data, `id`, SUM(`qtde`) AS `total`
FROM `venda`
WHERE `venda`.`deleted_at` IS NULL
GROUP BY `datacompra`
ORDER BY `datacompra` ASC