app/Controllers/ProdutoController.php

SELECT *
FROM `produto`
WHERE `produto`.`deleted_at` IS NULL
ORDER BY `descproduto` ASC
---
    public function index()
    {
        $data = [
            'produtos' => $this->produtoModel->orderBy('descproduto', 'asc')->findAll()
        ];

SELECT *
FROM `categoria`
WHERE `categoria`.`deleted_at` IS NULL
ORDER BY `nomecategoria` ASC
---
    public function inserir()
    {
        $data['acao'] = 'Inserir';

        /*   helper('form');
        $categoriaModel = new Categoria();
        $lista = $categoriaModel->findAll();
        $categorias = [];

        foreach ($lista as $item) {
            $categorias[$item->id] = $item->nomecategoria;
        }*/

        // $data['idcategoria'] = form_dropdown('idcategoria', $categorias);

        if ($_SERVER['REQUEST_METHOD'] === 'POST') {
            if ($this->produtoModel->insert($this->request->getPost(), false)) {
                $this->session->setFlashdata('estilo', 'alert-success');
                $this->session->setFlashdata('msg', 'Produto inserido!');
            } else {
                $this->session->setFlashdata('estilo', 'alert-warning');
                $this->session->setFlashdata('msg', 'Não foi possível cadastrar o produto!');
            }
            return redirect()->to(base_url('/produtos'));
        }

        $categoria = new Categoria();
        $data['categorias'] = $categoria->orderBy('nomecategoria', 'asc')->findAll();