app/Controllers/VendaController.php

SELECT `venda`.`id`, `venda`.`datacompra`, `venda`.`valorunitario`, `c`.`nome`
FROM `venda`
JOIN `cliente` as `c` ON `c`.`id`=`venda`.`idcliente`
WHERE `venda`.`deleted_at` IS NULL
ORDER BY `datacompra` DESC
---
    public function index()
    {
        $data = [
            'vendas' => $this->vendaModel
                ->select('venda.id,venda.datacompra,venda.valorunitario,c.nome')
                ->join('cliente as c', 'c.id=venda.idcliente')
                ->orderBy('datacompra', 'desc')->findAll(),
        ];

INSERT INTO `venda` (`idcliente`, `idproduto`, `qtde`, `valorunitario`, `datacompra`, `created_at`, `updated_at`) VALUES ('18', '9', '2', '34', '2023-01-03', '2023-01-08 13:05:17', '2023-01-08 13:05:17')
SELECT *
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
ORDER BY `nome` ASC
SELECT *
FROM `produto`
WHERE `produto`.`deleted_at` IS NULL
ORDER BY `descproduto` ASC
---
    public function inserir()
    {
        $data['acao'] = 'Gravar';

        if ($_SERVER['REQUEST_METHOD'] === 'POST') {
            if ($this->vendaModel->insert($this->request->getPost(), false)) {
                $this->session->setFlashdata('estilo', 'alert-success');
                $this->session->setFlashdata('msg', 'Venda inserida!');
            } else {
                $this->session->setFlashdata('estilo', 'alert-warning');
                $this->session->setFlashdata('msg', 'Não foi possível gravar a venda!');
            }
            return redirect()->to(base_url('/vendas'));
        }

        $cliente = new Cliente();
        $data['clientes'] = $cliente->orderBy('nome', 'asc')->findAll();

        $produto = new Produto();
        $data['produtos'] = $produto->orderBy('descproduto', 'asc')->findAll();